Revit 2026 API

# ParameterFilterUtilities Class

---

Contains static utility functions for enumerating the categories and parameters that are available for use by ParameterFilterElement objects.

SystemObject Autodesk.Revit.DBParameterFilterUtilities

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ParameterFilterUtilities
```
```vb
Public NotInheritable Class ParameterFilterUtilities
```
```cpp
public ref class ParameterFilterUtilities abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ParameterFilterUtilities = class end
```

The ParameterFilterUtilities type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllFilterableCategories | Returns the set of categories that may be used in a ParameterFilterElement. |
|  | GetFilterableParametersInCommon |  |
|  | GetInapplicableParameters |  |
|  | IsParameterApplicable | Used to determine whether the element supports the given parameter. |
|  | RemoveUnfilterableCategories |  |

#### Reference

Autodesk.Revit.DB Namespace